{
    "sections": [
    {
      "metadata": {
       "section_name": "Recruitment Policy",
       "keywords": ["manpower requisition", "recruitment process", "interview panel", "medical examination"],
       "page_number": [9, 11],
       "category": "Recruitment",
       "sub_category": "Recruitment Process",
       "difficulty_level": "Intermediate",
       "date_updated": "2024-09-10",
       "qa_pairs": [
         {
         "input": "What is the process for raising a manpower requisition at Tech Enerzal?",
         "response": "Manpower requisition at Tech Enerzal is initiated by the concerned department by filling a Manpower Requisition Form (MRF). The MRF must include the pay level, tenure of employment, and a brief job description. The requisition is approved by the Director before recruitment begins.",
         "source": "HR Policy Manual, Page 9"
         },
         {
         "input": "What documents are required during the joining process at Tech Enerzal?",
         "response": "During the joining process, candidates are required to submit documents including mark sheets from 10th to the last qualified exam, passing certificates, birth certificate, address proof, relieving letter from the last employer, medical fitness certificate, and identification proof such as Aadhar card, PAN card, or passport.",
         "source": "HR Policy Manual, Page 11"
         },
         {
         "input": "Who constitutes the interview panel for positions at Tech Enerzal?",
         "response": "For Manager and above positions, the interview panel includes members such as the OEDC member, Dean, Chief Administrative Officer, Head of Department, and the Associate Vice President - HR. Additional experts may be included if required.",
         "source": "HR Policy Manual, Page 10"
         },
         {
         "input": "What are the criteria for selecting a candidate at Tech Enerzal?",
         "response": "Candidates are selected based on personal interviews, skill tests, group discussions, and reference checks. The final selection is subject to a medical examination.",
         "source": "HR Policy Manual, Page 11"
         },
         {
         "input": "What is the role of the HR department in recruitment at Tech Enerzal?",
         "response": "The HR department is responsible for processing applications, scheduling interviews, conducting background checks, and negotiating salaries during the recruitment process.",
         "source": "HR Policy Manual, Page 9"
         },
         {
         "input": "What is the medical examination requirement during recruitment?",
         "response": "All candidates must undergo a medical examination either at the Tech Enerzal facility or through a recognized civil hospital. The doctor may request additional tests if necessary.",
         "source": "HR Policy Manual, Page 11"
         },
         {
         "input": "What steps are included in Tech Enerzal's joining process?",
         "response": "The joining process includes the submission of the Candidate’s Statement & Declaration, document verification, submission of a joining report, and the issuing of a Joining Memorandum.",
         "source": "HR Policy Manual, Page 11"
         },
         {
         "input": "What kind of advertisement process is followed for recruitment at Tech Enerzal?",
         "response": "Tech Enerzal releases recruitment advertisements in newspapers, and feedback is gathered from the relevant department heads before publication.",
         "source": "HR Policy Manual, Page 9"
         },
         {
         "input": "How are applications processed during recruitment?",
         "response": "The HR department is responsible for segregating resumes, compiling the details of applicants, and forwarding them to the concerned department for shortlisting.",
         "source": "HR Policy Manual, Page 9"
         },
         {
         "input": "What kind of travel reimbursement is provided to candidates during recruitment?",
         "response": "For Manager and above positions, economy air travel fare is reimbursed. For Level 6 to Level 9 positions, AC 3-Tier train fare is reimbursed, and Sleeper Class train fare is reimbursed for lower levels.",
         "source": "HR Policy Manual, Page 10"
         }
        ]
      },
      "description": "The recruitment process at Tech Enerzal starts with the Manpower Requisition Form (MRF). This form is filled by the concerned department, detailing the pay level, tenure of employment, job description, and justification for the position. The approval process requires the MRF to be signed off by the department chairperson and then forwarded to the HR department. The HR Manager and the Associate Vice President-HR discuss the proposal with the department head and the Director, who give the final approval. Once approved, the job advertisement is prepared and released in selected newspapers. The advertisement copy may also be reviewed by the Head of Department for feedback before publication. The HR department segregates resumes based on eligibility and sends them to the concerned department for shortlisting. After shortlisting, the interview panel is constituted. For Manager and above positions, the interview panel includes the OEDC member, Dean, Chief Administrative Officer, Head of Department, Associate Vice President-HR, and any expert nominated by the Director. For positions below Manager level, the panel consists of the SEDC member, Head of Department, Associate VP-HR, and a nominated person. The interview process may include personal interviews, skill tests, group discussions, debates, or quizzes. Candidates are informed via email, followed by a formal letter for interview scheduling. After the interview, feedback from panel members is documented, and the HR department assists with salary negotiations and collects feedback from references if necessary. Travel reimbursement for Manager and above positions covers economy class airfare. For candidates applying to positions from Level 6 to Level 9, AC 3-tier train fare is reimbursed, while those below Level 6 are reimbursed sleeper class train fare. After selection, candidates must undergo a medical check-up or submit a fitness certificate. The joining procedure involves collecting primary details through a Candidate’s Statement and Declaration form and verifying documents such as mark sheets, certificates, birth certificate, address proof, relieving letter, latest salary slip, medical certificate, and identity proof. The final steps include the issuance of a joining report and an identity card."
  
    },
    {
      "metadata": {
       "section_name": "Appointments and Promotions",
       "keywords": ["appointment policies", "promotion criteria", "performance-based promotions"],
       "page_number": [30, 45],
       "category": "Appointments",
       "sub_category": "Promotion Process",
       "difficulty_level": "Intermediate",
       "date_updated": "2024-09-10",
       "qa_pairs": [
         {
            "input": "What types of appointments does Tech Enerzal offer?",
            "response": "Tech Enerzal offers appointments on a Tenure Based Scaled Contract initially, with salary and allowances aligned with the government scales. Permanent appointments may be offered later based on performance.",
            "source": "HR Policy Manual, Page 30"
         },
         {
            "input": "How are promotion decisions made at Tech Enerzal?",
            "response": "Promotion decisions at Tech Enerzal are based on factors such as length of service, annual appraisal scores, and qualification points. A promotion committee reviews these parameters before making recommendations.",
            "source": "HR Policy Manual, Page 30"
         },
         {
            "input": "How does Tech Enerzal handle promotions for staff in Pay Level 6 and above?",
            "response": "For staff in Pay Level 6 and above, the appointing authority is the Chief Administrative Officer. The promotion process includes annual appraisals, written tests, and committee evaluations.",
            "source": "HR Policy Manual, Page 30"
         },
         {
            "input": "What are the criteria for performance-based promotions?",
            "response": "Performance-based promotions at Tech Enerzal are granted based on annual performance appraisals, overall contribution to the organization, and service tenure.",
            "source": "HR Policy Manual, Page 30"
         },
         {
            "input": "What is the role of the Director in promotions at Tech Enerzal?",
            "response": "The Director at Tech Enerzal has the authority to interpret, change, or suspend promotion policies and is involved in finalizing promotion decisions.",
            "source": "HR Policy Manual, Page 30"
         },
         {
            "input": "What happens if an employee is promoted to a higher pay scale?",
            "response": "Employees promoted to a higher pay scale are eligible for all the benefits associated with the new pay level, including revised allowances and bonuses.",
            "source": "HR Policy Manual, Page 30"
         },
         {
            "input": "Are there specific promotion policies for administrative and academic staff?",
            "response": "Yes, Tech Enerzal has distinct promotion policies for administrative and academic staff, focusing on experience, qualifications, and appraisal scores.",
            "source": "HR Policy Manual, Page 30"
         },
         {
            "input": "What is the process for reviewing promotion appeals?",
            "response": "Promotion appeals are reviewed by a separate committee that evaluates the employee's performance records and reasons for appeal before making a decision.",
            "source": "HR Policy Manual, Page 45"
         },
         {
            "input": "How often are promotion cycles conducted at Tech Enerzal?",
            "response": "Promotion cycles at Tech Enerzal are typically conducted annually, with results based on appraisals and recommendations from department heads.",
            "source": "HR Policy Manual, Page 45"
         },
         {
            "input": "Can employees be promoted without an increase in pay level?",
            "response": "Yes, employees may receive functional promotions without a change in pay level, based on increased responsibilities and performance.",
            "source": "HR Policy Manual, Page 30"
         }
        ]
      },
      "description": "At Tech Enerzal, appointments are often made on a Tenure Based Scaled Contract. Employees appointed under this contract receive benefits equivalent to those of permanent staff, including various types of leave, Leave Travel Concession, medical dispensary facilities, House Rent Allowance, and Dearness Allowance, according to the rules applicable to Central Government employees stationed in Ahmedabad. Promotions at Tech Enerzal are based on a seniority-cum-performance principle. Key factors in determining promotion eligibility include the number of years of service, with two points awarded for each year, performance appraisal scores, and educational qualifications. Additional qualifications gained during employment, such as a Master's degree or diploma, may contribute up to 10 points toward promotion. For certain higher-level promotions, such as moving from Level 7 to Level 10, an internal examination may be required. The Senior Executive Development Committee reviews performance appraisal scores and may normalize them across departments to ensure fairness. Promotions are conducted annually, typically between September and October, once performance appraisals are finalized."

    },
    {
      "metadata": {
        "section_name": "Leave and Attendance",
        "keywords": ["leave policy", "attendance", "casual leave", "earned leave"],
        "page_number": [68, 74],
        "category": "Leave",
        "sub_category": "Leave Policy",
        "difficulty_level": "Basic",
        "date_updated": "2024-09-10",
        "qa_pairs": [
          {
            "input": "What is the procedure for granting leave at Tech Enerzal?",
            "response": "The grant of leave is governed by Institute Leave Rules. Leave should be applied through the ESS portal, and any leave for more than two days should be applied at least 10 days in advance.",
            "source": "HR Policy Manual, Page 69"
          },
          {
            "input": "How is casual leave administered?",
            "response": "Casual leave admissible to an employee is eight days per calendar year. Casual leave can be taken for half a day and combined with special casual leave but not with other kinds of leave.",
            "source": "HR Policy Manual, Page 70"
          },
          {
            "input": "What are the rules for extension of leave?",
            "response": "Leave extensions should be avoided as much as possible, and any request for extension must be submitted well in advance. Extensions without proper sanction will be treated as Extraordinary Leave (EOL).",
            "source": "HR Policy Manual, Page 69"
          },
          {
            "input": "How much earned leave can be accumulated?",
            "response": "The maximum accumulation of earned leave is 300 days. Earned leave is credited at 2.5 days per completed month and can be availed up to 180 days at a time.",
            "source": "HR Policy Manual, Page 70"
          },
          {
            "input": "What happens if an employee is absent without leave?",
            "response": "Absence without leave, not in continuation of any authorized leave, will constitute an interruption of service unless it is regularized.",
            "source": "HR Policy Manual, Page 69"
          },
          {
            "input": "Can paternity leave be refused?",
            "response": "Paternity leave is not to be refused under normal circumstances. A male employee with less than two surviving children is eligible for 15 days of paternity leave.",
            "source": "HR Policy Manual, Page 74"
          },
          {
            "input": "What is the process for applying for leave at Tech Enerzal?",
            "response": "Employees must apply for leave through the Employee Self Service (ESS) portal, and it should be submitted in the same month in which it is availed.",
            "source": "HR Policy Manual, Page 69"
          },
          {
            "input": "What is the rule for combining maternity leave with other leaves?",
            "response": "Maternity leave of 180 days can be combined with any other kind of leave. This leave is admissible only to female employees with fewer than two surviving children.",
            "source": "HR Policy Manual, Page 73"
          },
          {
            "input": "What are the consequences of late attendance?",
            "response": "Late attendance for up to one hour on two occasions in a month can be condoned by the Supervisor. However, further late attendance will result in the debiting of half-a-day casual leave.",
            "source": "HR Policy Manual, Page 68"
          },
          {
            "input": "What are the entitlements for public and restricted holidays?",
            "response": "The Institute observes public holidays and restricted holidays every year, based on the list of holidays declared by the Government of India.",
            "source": "HR Policy Manual, Page 74"
          }
        ]
      },
      "description": "The leave policy at Tech Enerzal provides employees with various types of leaves and outlines the procedures for applying and granting them. Casual leave allows employees to take 8 days per year, with a limit of 5 days at one time. Casual leave cannot be carried forward, and any unused days will lapse at the end of the year. Employees can combine casual leave with public holidays but not with other types of leave. Half-day casual leave is also available. Earned leave provides administrative staff with 30 days per year, credited as 15 days on January 1st and 15 days on July 1st. Earned leave can be accumulated up to 300 days and taken for a maximum of 180 days at a time. It is reduced by one-tenth of extraordinary leave or days without pay taken in the previous half-year. Half-pay leave is provided at 20 days per year of service and is generally for medical reasons. Commuted leave is allowed at half the number of half-pay leave days. Employees can use commuted leave for maternity purposes, up to 60 days, without a medical certificate. Maternity leave entitles female employees to 180 days of paid leave, applicable only to those with fewer than two surviving children. In cases of miscarriage, up to 45 days of leave is provided. Paternity leave grants male employees 15 days, which can be taken within six months of the child's birth. Earned leave encashment is possible for up to 60 days during the entire service period, provided the employee retains a balance of at least 30 days after encashment."

    },
    {
      "metadata": {
        "section_name": "Performance Review",
        "keywords": ["performance appraisal", "self-appraisal", "managerial competency"],
        "page_number": [75, 83],
        "category": "Performance",
        "sub_category": "Appraisal",
        "difficulty_level": "Intermediate",
        "date_updated": "2024-09-10",
          
        "qa_pairs": [
          {
            "input": "What is the frequency of performance appraisals at Tech Enerzal?",
            "response": "Performance appraisals are conducted annually, with the evaluation period being from 1st July to 30th June. Employees who have completed a minimum of six months of service are eligible for performance review.",
            "source": "HR Policy Manual, Page 75"
          },
          {
            "input": "What is included in the performance evaluation form?",
            "response": "The performance evaluation form includes a self-appraisal section, evaluation by the reporting manager, and a review by the next higher authority. Specific facts are recorded to arrive at a quantitative assessment.",
            "source": "HR Policy Manual, Page 76"
          },
          {
            "input": "How does Tech Enerzal handle performance discussions?",
            "response": "Supervisors call appraisees for a performance review meeting to discuss their performance and self-appraisal in detail. These discussions are recorded and reviewed by higher authorities.",
            "source": "HR Policy Manual, Page 76"
          },
          {
            "input": "What are the key criteria for appraising managers?",
            "response": "Managerial appraisals include evaluating the nature and quality of work, outstanding contributions, work conditions, and suggestions for improvements from both the appraiser and appraisee.",
            "source": "HR Policy Manual, Page 77"
          },
          {
            "input": "What happens to appraisal forms after they are completed?",
            "response": "The completed performance appraisal forms are submitted to the Staff Evaluation and Development Committee (SEDC) or Officer Evaluation and Development Committee (OEDC) for review and recommendations.",
            "source": "HR Policy Manual, Page 76"
          },
          {
            "input": "What is the role of self-appraisal in performance review?",
            "response": "The self-appraisal section requires the employee to honestly assess their own work, accomplishments, and challenges before discussing them with their supervisor.",
            "source": "HR Policy Manual, Page 75"
          },
          {
            "input": "What are the possible outcomes of a performance appraisal?",
            "response": "Performance appraisals can lead to rewards, promotions, development decisions, and opportunities for training, field visits, or job rotations.",
            "source": "HR Policy Manual, Page 77"
          },
          {
            "input": "What are the expectations for reviewing managers during appraisals?",
            "response": "Reviewing managers must provide at least three justifications for their rating and make recommendations based on employee priorities and performance.",
            "source": "HR Policy Manual, Page 76"
          },
          {
            "input": "What is the purpose of appraising the performance of managers?",
            "response": "The performance review of managers aims to assess their managerial and behavioral qualities, helping them to strengthen their competencies and effectiveness in the role.",
            "source": "HR Policy Manual, Page 77"
          },
          {
            "input": "What is the next step after the review of appraisal forms by the committee?",
            "response": "After reviewing, the recommendations of SEDC/OEDC are implemented, subject to the Director’s approval.",
            "source": "HR Policy Manual, Page 76"
          }
        ]
      },

      "description": "The performance review process at Tech Enerzal is structured to take place annually, covering the period from July 1st to June 30th. Employees with at least six months of service are eligible for a review. The appraisal process begins with a self-assessment, where employees detail their achievements, challenges, and areas for development. Managers then review the self-appraisals, giving feedback on aspects such as job knowledge, work quality, and communication. The Head of Department provides a final rating and must give at least three justifications for their rating. This rating process ensures differentiation among employees based on their performance. Managerial appraisals include assessments of leadership, team management, and decision-making capabilities. These reviews help document contributions, identify development needs, and suggest further training or job rotations. Completed appraisal forms are submitted to the Staff Evaluation and Development Committee or the Officer's Evaluation and Development Committee, who review and provide recommendations for rewards or training. Final decisions on rewards and promotions require the Director's approval."
  
    },
    {
      "metadata": {
        "section_name": "General Conduct, Ethics & Disciplinary Action",
        "keywords": ["conduct rules", "ethics", "disciplinary actions", "employee behavior"],
        "page_number": [45, 65],
        "category": "Conduct",
        "sub_category": "Ethics",
        "difficulty_level": "Intermediate",
        "date_updated": "2024-09-10",
          
        
        "qa_pairs": [
          {
            "input": "What are the key conduct rules employees must follow?",
            "response": "Employees must maintain integrity, devotion to duty, independence in decision-making, and political neutrality. They are also required to act courteously with the public and observe proper decorum at the workplace.",
            "source": "HR Policy Manual, Page 46"
          },
          {
            "input": "What actions are prohibited under the conduct rules?",
            "response": "Employees are prohibited from acts such as dishonesty, insubordination, intoxication, and accepting lavish hospitality from organizations with official dealings.",
            "source": "HR Policy Manual, Page 46"
          },
          {
            "input": "What are the consequences of drug or alcohol consumption at work?",
            "response": "Any employee found taking drugs, consuming alcohol, or smoking in the office will face disciplinary action. Employees may also be asked to undergo drug/alcohol testing if suspected.",
            "source": "HR Policy Manual, Page 46"
          },
          {
            "input": "How does Tech Enerzal handle disciplinary actions?",
            "response": "Disciplinary actions at Tech Enerzal follow a structured procedure, including written warnings, penalties for misconduct, and in severe cases, suspension or termination.",
            "source": "HR Policy Manual, Page 46"
          },
          {
            "input": "What are the reporting obligations for employees involved in legal cases?",
            "response": "Employees must report to their superiors if they are involved in any civil or criminal cases and provide the necessary details about the proceedings.",
            "source": "HR Policy Manual, Page 46"
          },
          {
            "input": "What happens if an employee is found possessing weapons in the office?",
            "response": "Possession of weapons in the office is considered a serious disciplinary offense and will be dealt with according to the disciplinary action procedures.",
            "source": "HR Policy Manual, Page 46"
          },
          {
            "input": "What is expected of employees regarding the use of Tech Enerzal assets?",
            "response": "Employees are expected to use Tech Enerzal’s assets responsibly for legitimate business purposes only. Theft, carelessness, or wastage of resources will be treated seriously.",
            "source": "HR Policy Manual, Page 46"
          },
          {
            "input": "What are the reporting requirements for participating in public seminars?",
            "response": "Non-faculty employees must seek prior approval from the Institute for making speeches or presentations in public seminars, detailing the venue, theme, and purpose.",
            "source": "HR Policy Manual, Page 45"
          },
          {
            "input": "What are the consequences of unethical behavior?",
            "response": "Unethical behavior, including dishonesty, conflicts of interest, or negligence, can lead to disciplinary actions ranging from warnings to termination, depending on the severity of the offense.",
            "source": "HR Policy Manual, Page 46"
          },
          {
            "input": "How should employees handle media queries?",
            "response": "All media queries should be directed to the General Manager - Communications. Employees are prohibited from dealing directly with the media without proper authorization.",
            "source": "HR Policy Manual, Page 45"
          }
        ]
      },
      "description": "The conduct, ethics, and disciplinary guidelines at Tech Enerzal emphasize maintaining integrity and impartiality in all official duties. Employees must avoid conflicts of interest and ensure responsible behavior both at work and in their personal lives. The policy requires employees to remain politically neutral and handle public dealings with courtesy and promptness. Employees are expected to uphold confidentiality and use Tech Enerzal assets responsibly, with waste or misuse considered a serious offense. Prohibited actions include joining banned organizations, accepting lavish gifts, or lending money to people with whom the employee has official dealings. Possession of drugs, alcohol, or weapons on Tech Enerzal premises is strictly prohibited, with disciplinary actions ranging from suspension to termination. Employees may be subjected to drug or alcohol testing upon reasonable suspicion. Disciplinary offenses are categorized as minor or major, with penalties based on the severity of the misconduct. Employees arrested for criminal offenses are required to inform the Institute, which may conduct its own inquiry into the situation. A detailed policy is in place for addressing sexual harassment complaints, with a committee conducting investigations within 90 days and making recommendations within 30 days. Interim measures such as transfers, paid leave, or restraining orders may be taken to ensure safety during the investigation. The identities of those involved in sexual harassment complaints are protected to maintain confidentiality throughout the process."
  
    },
    {
      "metadata": {
        "section_name": "Medical Reimbursement and Facilities",
        "keywords": ["medical reimbursement", "healthcare", "facility", "consultation"],
        "page_number": [111, 112],
        "category": "Healthcare",
        "sub_category": "Reimbursement",
        "difficulty_level": "Intermediate",
        "date_updated": "2024-09-10",
          
       
        "qa_pairs": [
          {
            "input": "What is the process for medical reimbursement at Tech Enerzal?",
            "response": "Medical reimbursement at Tech Enerzal requires employees to submit claims in a prescribed form along with cash memos, prescriptions, and details certified by the Institute doctor. Payments are processed monthly.",
            "source": "HR Policy Manual, Page 112"
          },
          {
            "input": "What medical services are available on the Tech Enerzal campus?",
            "response": "The Tech Enerzal campus has a dispensary providing general healthcare services, emergency treatments, and consultancy with specialists like gynecologists and nephrologists. The dispensary operates from 8 AM to 5:45 PM on weekdays.",
            "source": "HR Policy Manual, Page 107"
          },
          {
            "input": "What are the conditions for reimbursement of Ayurvedic medicines?",
            "response": "Ayurvedic medicines are reimbursed provided they are prescribed by the RMO of Akhandanand Ayurvedic Hospital and purchased from specific Ayurvedic stores in Ahmedabad.",
            "source": "HR Policy Manual, Page 113"
          },
          {
            "input": "What are the rules for reimbursement of homeopathic treatments?",
            "response": "Employees opting for homeopathic treatments must consult recognized doctors, preferably attached to a Civil or Trust hospital in Ahmedabad. The doctor must issue a certification for reimbursement claims.",
            "source": "HR Policy Manual, Page 113"
          },
          {
            "input": "What is the policy for medical treatment in emergencies?",
            "response": "In case of emergencies where the Institute doctor is unavailable, employees may consult any of the designated doctors or doctors of their choice. The Institute doctor must be informed the following day.",
            "source": "HR Policy Manual, Page 112"
          },
          {
            "input": "What are the reimbursement limits for medical procedures?",
            "response": "Reimbursement limits for various procedures include Rs. 3500 for MRI without contrast, Rs. 2000 for a TMT, and Rs. 400 for an ECG.",
            "source": "HR Policy Manual, Page 112"
          },
          {
            "input": "What happens if a prescription is from a doctor outside Ahmedabad?",
            "response": "If the prescription is from outside Ahmedabad, the Institute doctor will need to certify the claim for reimbursement. For local cases, the medical officer will handle this.",
            "source": "HR Policy Manual, Page 113"
          },
          {
            "input": "Are diet charges reimbursed?",
            "response": "Diet charges incurred during medical treatment are not reimbursable as per the institute's policy.",
            "source": "HR Policy Manual, Page 113"
          },
          {
            "input": "How are medical consultancy fees reimbursed?",
            "response": "Consultancy fees are reimbursed based on a standard rate of Rs. 600 per consultation and Rs. 400 for follow-up visits. Specialist fees range between Rs. 800 to Rs. 1000 depending on the type.",
            "source": "HR Policy Manual, Page 112"
          },
          {
            "input": "How should medical claims be submitted?",
            "response": "Medical claims must be submitted within six months of incurring the expenses and should include all relevant documentation and certifications from the prescribing doctor.",
            "source": "HR Policy Manual, Page 113"
          }
        ]
      },
      "description": "Tech Enerzal offers medical facilities and reimbursements for its employees. The Institute’s dispensary provides basic medical services with designated timings for general and specialist consultations. Emergency medical care is available for employees and their dependents, with the option to consult external doctors if the institute’s doctors are unavailable. Employees are encouraged to use the cashless facility available through Neuberg Supratech Diagnostics Centre for pathology services, which covers both faculty and staff along with their dependents. External consultations require pre-approval or counter-signing by the institute doctor to qualify for reimbursement. The consultancy fees and specific medical procedures are reimbursed according to set rates, such as ₹600 for consultations and ₹225 for ECGs. More complex procedures like MRIs and CT scans are covered at rates between ₹2000 and ₹5000, depending on the type of scan. Physiotherapy is reimbursed at ₹100 per basic session and ₹200 for advanced sessions. For employees who opt for alternative medicine systems like Ayurveda or Homeopathy, the institute reimburses medical expenses provided treatments are through government-recognized practitioners or facilities. In such cases, consultation fees are reimbursed up to the same limits as allopathic treatments. Medicines must be purchased locally, and detailed cash memos must be submitted for reimbursement. For hospitalization, 24-hour admission is required for reimbursement, but day-care procedures such as dialysis, chemotherapy, and cataract surgeries are exceptions. Pre-hospitalization expenses for up to 60 days and post-hospitalization expenses for up to 90 days are also covered."
  
    },
    {
      "metadata": {
        "section_name": "Grievance Policy",
        "keywords": ["grievance redressal", "grievance manager", "dispute resolution"],
        "page_number": [163, 164],
        "category": "Workplace",
        "sub_category": "Grievance Handling",
        "difficulty_level": "Basic",
        "date_updated": "2024-09-10",
         
      
       "qa_pairs": [
          {
            "input": "What is the role of the Grievance Manager at Tech Enerzal?",
            "response": "The Grievance Manager at Tech Enerzal coordinates and administers the grievance handling process and ensures proper documentation. They serve as the point of contact for grievance submissions.",
            "source": "HR Policy Manual, Page 163"
          },
          {
            "input": "What is the process for submitting a grievance?",
            "response": "Employees must submit their grievances in writing to their supervisor or head of department. If unresolved, the grievance is forwarded to the Grievance Manager, who will take it to the Grievance Redressal Committee.",
            "source": "HR Policy Manual, Page 164"
          },
          {
            "input": "How long should the grievance resolution process take?",
            "response": "The entire grievance resolution process should not take more than three weeks from the time of submission.",
            "source": "HR Policy Manual, Page 164"
          },
          {
            "input": "Who handles unresolved grievances?",
            "response": "Unresolved grievances are forwarded by the Grievance Redressal Committee to the Director or Dean of the Institute for a final decision.",
            "source": "HR Policy Manual, Page 163"
          },
          {
            "input": "What happens if an employee is dissatisfied with the response from the CAO?",
            "response": "If dissatisfied with the response from the CAO, the employee can escalate the grievance to the Grievance Manager, who will acknowledge receipt and forward it to the Grievance Redressal Committee.",
            "source": "HR Policy Manual, Page 163"
          },
          {
            "input": "What is the structure of the Grievance Redressal Committee?",
            "response": "The Grievance Redressal Committee is responsible for addressing all grievances. It gathers feedback from relevant parties and makes recommendations for resolving the issue.",
            "source": "HR Policy Manual, Page 163"
          },
          {
            "input": "How frequently does the Grievance Committee meet?",
            "response": "Initially, the Grievance Redressal Committee meets frequently to handle cases, aiming to resolve grievances within three months.",
            "source": "HR Policy Manual, Page 164"
          },
          {
            "input": "What is the role of the Director in grievance resolution?",
            "response": "The Director is the final authority in grievance matters if the intervention of the Dean or CAO is insufficient to resolve the issue.",
            "source": "HR Policy Manual, Page 163"
          },
          {
            "input": "What reporting is required by the Grievance Committee?",
            "response": "The Grievance Committee submits quarterly reports on grievances handled to the Director and an annual report with recommendations for reducing future grievances.",
            "source": "HR Policy Manual, Page 164"
          },
          {
            "input": "What is the aim of the Tech Enerzal Grievance Policy?",
            "response": "The Grievance Policy aims to provide a conducive work environment by ensuring that grievances are dealt with fairly and promptly.",
            "source": "HR Policy Manual, Page 163"
          }
        ]
      },
      "description": "Tech Enerzal has a well-structured grievance redressal system to address any employee complaints or concerns. A designated Grievance Manager oversees the process. Employees are first required to submit grievances in writing to their supervisor or head of the department, who must acknowledge receipt. If the issue remains unresolved at this stage, the grievance can be escalated to the Grievance Manager. The Grievance Redressal Committee, comprising senior members of the institute, then reviews the case and seeks feedback from relevant parties. The committee is expected to address grievances within two weeks and submit recommendations for resolution. In some cases, the grievance may be forwarded to the Dean or the Director if further intervention is needed. The entire process should ideally be completed within three weeks to three months, depending on the complexity of the issue. A quarterly and annual report of grievances handled is submitted to the Director, and recommendations are made to improve institutional policies and reduce the occurrence of grievances in the future."
  
    },
    {
      "metadata": {
        "section_name": "Retirement and Resignation",
        "keywords": ["retirement", "resignation", "superannuation"],
        "page_number": [165, 166],
        "category": "Workplace",
        "sub_category": "Employee Exit",
        "difficulty_level": "Basic",
        "date_updated": "2024-09-10",
       "qa_pairs": [
          {
            "input": "What is the retirement age at Tech Enerzal?",
            "response": "The retirement age at Tech Enerzal is 60 years for regular employees, with some exceptions for extension based on performance and the institute's needs.",
            "source": "HR Policy Manual, Page 165"
          },
          {
            "input": "What are the conditions for voluntary retirement?",
            "response": "Employees can opt for voluntary retirement after completing 20 years of service, subject to approval from the Director.",
            "source": "HR Policy Manual, Page 165"
          },
          {
            "input": "What is the procedure for resignation?",
            "response": "Employees wishing to resign must provide a formal resignation letter and serve a notice period of at least 1 to 3 months, depending on their role.",
            "source": "HR Policy Manual, Page 166"
          },
          {
            "input": "How is gratuity calculated upon retirement?",
            "response": "Gratuity is calculated based on the employee’s last drawn salary and the number of years of service, up to a maximum limit as per government regulations.",
            "source": "HR Policy Manual, Page 165"
          },
          {
            "input": "Can employees work after retirement at Tech Enerzal?",
            "response": "Post-retirement employment is subject to approval and based on the needs of the institute. Retired employees may be hired on a contract basis.",
            "source": "HR Policy Manual, Page 165"
          }
        ]
      },
      "description": "At Tech Enerzal, the retirement age for faculty members is 65 years, while for administrative staff it is 60 years. Employees must retire on the last day of the month in which they reach the age of superannuation, except when their birthdate falls on the first day of the month, in which case they retire at the end of the previous month. The institute mandates that employees relinquish their official duties on their last working day, even if it falls on a holiday. Upon retirement, employees are entitled to pension and gratuity benefits. However, the pension may be withheld or withdrawn if the retired employee is convicted of a serious crime or grave misconduct. Employees re-employed after retirement are not eligible for a second pension. Resignations must follow the terms of the employee's appointment letter, and all outstanding dues will be settled only after a clearance certificate is issued. The resignation process includes returning all institutional property and obtaining the necessary sign-offs from various departments. Employees may also retain campus housing for up to two months after retirement, but this requires prior approval. Further extension beyond this period incurs additional charges and may result in a deduction from retirement benefits."
  
    },
    {
      "metadata": {
        "section_name": "Training & Development",
        "keywords": ["employee development", "training", "skills enhancement"],
        "page_number": [153, 155],
        "category": "Workplace",
        "sub_category": "Professional Development",
        "difficulty_level": "Intermediate",
        "date_updated": "2024-09-10",
        
        
       "qa_pairs": [
          {
            "input": "What types of training programs are offered at Tech Enerzal?",
            "response": "Tech Enerzal offers a variety of training programs including leadership development, technical skills enhancement, and soft skills improvement.",
            "source": "HR Policy Manual, Page 153"
          },
          {
            "input": "Who is eligible for training programs?",
            "response": "All employees are eligible for training programs, with priority given to those whose roles require skill updates or leadership development.",
            "source": "HR Policy Manual, Page 153"
          },
          {
            "input": "How are employees selected for external training?",
            "response": "Employees are selected for external training based on their performance, role requirements, and recommendations from department heads.",
            "source": "HR Policy Manual, Page 154"
          },
          {
            "input": "Is there any financial incentive for completing training programs?",
            "response": "Yes, employees who complete certain designated training programs may be eligible for performance incentives or promotions.",
            "source": "HR Policy Manual, Page 154"
          },
          {
            "input": "How often are training needs assessed?",
            "response": "Training needs are assessed annually during performance reviews, and employees are encouraged to identify areas where they require further development.",
            "source": "HR Policy Manual, Page 154"
          }
        ]
      },
      "description": "The training and development program at Tech Enerzal aims to enhance the skills and knowledge of its employees. Training is categorized into three types: induction training, internal training, and specialized training. Induction training is provided to new recruits to familiarize them with the organization’s policies, procedures, and culture. It covers all relevant departments. Internal training addresses job-specific skills and competencies required for employees' current roles. These programs are conducted based on an annual training calendar prepared by the HR department in consultation with the Chief Administrative Officer (CAO). Specialized training programs are organized when a specific need is identified by the department heads. The HR department maintains a list of faculty members responsible for these training programs and arranges the necessary logistics. Employees who participate in training sessions are required to provide feedback, and the HR department keeps a record of all training programs, including feedback and evaluations. The programs' effectiveness is monitored, and retraining is provided if the performance of an employee in the program is found to be below expectations."
  
    },
    {
      "metadata": {
        "section_name": "Insurance Policies",
        "keywords": ["group insurance", "mediclaim", "accident insurance"],
        "page_number": [96, 105],
        "category": "Workplace",
        "sub_category": "Employee Benefits",
        "difficulty_level": "Intermediate",
        "date_updated": "2024-09-10",
          
        
        "qa_pairs": [
          {
            "input": "What group insurance schemes are available for employees at Tech Enerzal?",
            "response": "Tech Enerzal offers Group Savings Linked Insurance, Group Personal Accident Insurance, and Group Mediclaim Insurance for its employees.",
            "source": "HR Policy Manual, Page 96"
          },
          {
            "input": "Who is eligible for the Group Personal Accident Insurance?",
            "response": "All employees, including contractual and regular staff, are eligible for the Group Personal Accident Insurance scheme.",
            "source": "HR Policy Manual, Page 100"
          },
          {
            "input": "What does the Group Mediclaim Insurance cover?",
            "response": "The Group Mediclaim Insurance covers hospitalization, medical expenses, and surgical costs for employees and their dependents.",
            "source": "HR Policy Manual, Page 101"
          },
          {
            "input": "Is there an additional top-up option for Mediclaim insurance?",
            "response": "Yes, employees can opt for additional top-up coverage for both their own Mediclaim policy and their parents’ policy.",
            "source": "HR Policy Manual, Page 104"
          },
          {
            "input": "How are insurance claims processed?",
            "response": "Employees need to submit the necessary documents and medical bills to the HR department, which forwards them to the insurance provider for processing.",
            "source": "HR Policy Manual, Page 97"
          }
        ]
      },
      "description": "Tech Enerzal provides several insurance schemes for its employees to ensure their well-being and that of their families. One of the key policies is the Group Savings Linked Insurance Scheme (GSLIS), which is mandatory for all permanent employees who joined before July 31, 2014. The scheme combines life insurance with a savings component, and contributions are made by both the employee and the institute. In addition, the Group Personal Accident Insurance Scheme offers coverage ranging from ₹15 lakhs to ₹30 lakhs depending on the employee's grade. This policy covers hospitalization, accident-related expenses, and children's education benefits in case of death. Employees are also covered under the Group Mediclaim Insurance Scheme, which offers cashless hospitalization benefits. The maximum coverage per family under this policy ranges from ₹3 lakhs to ₹5 lakhs, depending on the employee's grade. This policy covers the employee, their spouse, and up to two children, and continues to provide coverage post-retirement until the employee or spouse reaches the age of 80. Employees also have the option to opt for additional top-up coverage on the mediclaim policy for themselves and their parents. The Group Term Insurance Policy provides a death benefit of up to ₹1 crore for faculty members, with lower coverage amounts for other grades. This term insurance ends upon resignation or retirement."
  
    },
    {
      "metadata": {
        "section_name": "Allowances & Benefits",
        "keywords": ["travel allowance", "relocation benefits", "educational allowance"],
        "page_number": [116, 127],
        "category": "Workplace",
        "sub_category": "Employee Benefits",
        "difficulty_level": "Intermediate",
        "date_updated": "2024-09-10",
          
        
        "qa_pairs": [
          {
            "input": "What travel allowances are provided for domestic travel?",
            "response": "Tech Enerzal provides daily allowances and reimbursement for travel expenses such as airfare and train tickets for employees on official domestic trips.",
            "source": "HR Policy Manual, Page 116"
          },
          {
            "input": "Are there allowances for international travel?",
            "response": "Yes, employees traveling internationally for official work are entitled to travel allowances, including air travel, accommodation, and daily expenses.",
            "source": "HR Policy Manual, Page 119"
          },
          {
            "input": "What is the Leave Travel Concession (LTC) policy?",
            "response": "Tech Enerzal offers Leave Travel Concession (LTC) for employees, allowing them to claim travel expenses for vacation trips once in a defined period.",
            "source": "HR Policy Manual, Page 120"
          },
          {
            "input": "What relocation benefits are provided by Tech Enerzal?",
            "response": "Tech Enerzal covers relocation expenses for new hires, including transportation of household goods, travel allowances for the employee and family, and temporary accommodation.",
            "source": "HR Policy Manual, Page 123"
          },
          {
            "input": "Is there an incentive for acquiring higher qualifications?",
            "response": "Yes, Tech Enerzal provides financial incentives for employees who acquire higher qualifications relevant to their role, particularly for Group B/C/D employees.",
            "source": "HR Policy Manual, Page 124"
          },
          {
            "input": "What is the policy for children’s education allowance?",
            "response": "Employees are eligible for a children’s education allowance, which covers part of the tuition fees for up to two dependent children studying in recognized institutions.",
            "source": "HR Policy Manual, Page 126"
          },
          {
            "input": "Does Tech Enerzal provide a uniform and livery allowance?",
            "response": "Yes, employees in certain roles, such as maintenance staff and security, are provided with a uniform and livery allowance to cover the cost of workwear.",
            "source": "HR Policy Manual, Page 127"
          },
          {
            "input": "Are employees eligible for washing allowances?",
            "response": "Yes, employees entitled to uniforms are also provided with a washing allowance to cover the costs of maintaining their work attire.",
            "source": "HR Policy Manual, Page 127"
          },
          {
            "input": "What are the provisions for extra duty allowances?",
            "response": "Employees who work beyond regular hours are eligible for extra duty allowances as compensation for their additional time and effort.",
            "source": "HR Policy Manual, Page 127"
          },
          {
            "input": "What benefits are provided under the Annual Development Allowance?",
            "response": "The Annual Development Allowance provides financial support for employees to pursue skill development and educational programs that enhance their professional abilities.",
            "source": "HR Policy Manual, Page 123"
          }
        ]
      },
      "description": "Tech Enerzal offers various allowances and benefits to its employees to support their professional and personal needs. For domestic travel, employees are entitled to travel by air, rail, or road, depending on their designation, with daily allowances provided to cover expenses during the trip. Faculty members are entitled to travel by economy class on flights and first-class or AC-2 tier on trains. For road travel, taxis or public buses can be used. Daily allowances vary based on the employee's rank and whether receipts are provided. Leave Travel Concession (LTC) is provided to employees to cover their travel expenses while on leave, and this can be used once every two years. Relocation charges are provided for employees transferring to a new location or joining the institute, covering moving expenses for the employee and their family. An annual development allowance is provided for employees to pursue educational or professional development opportunities. Group B, C, and D employees are eligible for incentives for acquiring higher qualifications, such as degrees or diplomas relevant to their roles. In addition, Tech Enerzal provides a children’s education allowance, covering school fees for up to two children. Employees also receive a washing allowance, uniform and liveries, extra duty allowances, and access to mess facilities on campus."
  
    },
    {
      "metadata": {
        "section_name": "Housing Policies",
        "keywords": ["employee housing", "campus housing", "retirement housing"],
        "page_number": [143, 147],
        "category": "Workplace",
        "sub_category": "Employee Housing",
        "difficulty_level": "Intermediate",
        "date_updated": "2024-09-10",
         
       
        "qa_pairs": [
          {
            "input": "What are the general housing provisions for Tech Enerzal employees?",
            "response": "Tech Enerzal provides housing facilities on campus for eligible employees, with allocation based on position and availability.",
            "source": "HR Policy Manual, Page 143"
          },
          {
            "input": "Can employees occupy campus housing after retirement?",
            "response": "Employees are required to vacate campus housing within a specified period after retirement, although extensions may be granted under special circumstances.",
            "source": "HR Policy Manual, Page 146"
          },
          {
            "input": "What is the policy for the use of campus housing for social or religious events?",
            "response": "Use of campus housing for social or religious events is allowed with prior approval from the Housing Department, subject to rules and regulations.",
            "source": "HR Policy Manual, Page 147"
          },
          {
            "input": "How is housing rent calculated for employees?",
            "response": "Housing rent for employees is determined based on their pay scale and the type of accommodation allotted to them.",
            "source": "HR Policy Manual, Page 143"
          },
          {
            "input": "Are there specific housing provisions for senior management?",
            "response": "Yes, senior management positions such as Deans and Directors are provided with larger accommodations on campus.",
            "source": "HR Policy Manual, Page 143"
          },
          {
            "input": "What happens if an employee is transferred during their tenure?",
            "response": "If an employee is transferred, they may be required to vacate their assigned housing, and new accommodation will be provided at their new location.",
            "source": "HR Policy Manual, Page 144"
          },
          {
            "input": "Is maintenance of campus housing the responsibility of the employee?",
            "response": "Basic maintenance of campus housing is managed by Tech Enerzal’s estate department, but employees are expected to keep the premises clean and report any issues.",
            "source": "HR Policy Manual, Page 144"
          }
        ]
      },
      "description": "Tech Enerzal provides different categories of housing accommodations to its staff based on their job roles and seniority. The housing facilities are divided into multiple types, ranging from Type V (for senior staff) to Type S (for support staff), with a total of several units available for allocation. Allocation is based on seniority within the respective pay ranges. In special circumstances, out-of-turn allotments may be made if institutional requirements demand it. Employees who do not accept the offer of housing have their names moved to the bottom of the waiting list, except in cases of institutional commitment or system changes. Employees who go on leave or deputation for up to a year may retain the house or allow the Institute to use it temporarily, with a right to reoccupy it upon return. For leaves exceeding one year, employees must surrender the house but retain their seniority. All occupants are considered licensees, not tenants. Employees are required to pay a license fee, which varies based on the type of housing and additional charges for utilities and services like electricity, water, and conservancy. Upon retirement, resignation, or termination, the house allotment is canceled, and the occupant must vacate the premises. The Director has the discretion to extend the retention of the house for up to four months post-retirement, at the rent last paid by the deceased or retiring occupant. Retention of the house beyond this period incurs additional charges, which increase based on the type of housing. Employees may also request to use campus houses for social or religious purposes, with a daily charge applied depending on the type of house. The Institute offers guest houses for faculty from other institutions, with specific rates and conditions for stay, including electricity and other utility charges. The Tech Enerzal Staff Co-operative Credit & Supply Society Ltd, established in 1964, is a registered co-operative society formed to provide prompt credit facilities to Tech Enerzal employees. Permanent employees of the Institute can become members of the society by completing the required formalities. Members contribute to the society’s share capital and savings through a compulsory savings scheme, with additional options like recurring deposits. The society provides emergency loans of up to ₹5,000 three times a year and full loans exceeding ₹5,000 up to a maximum of ₹4,00,000, depending on eligibility. Members also receive dividends on their share capital from the society's profits and interest on their compulsory savings. Upon superannuation or death, a lump sum of ₹15,000 is paid to the member or their nominee from the society’s retirement-cum-death benefit fund. The society’s business transactions are audited annually by an approved Chartered Accountant, a funding bank, and an auditor nominated by the Registrar of Co-operative Societies. Occasionally, the society may tie up with companies to offer goods at special rates or on credit to its members, providing additional benefits."
  
    }
  ] 
}
        